IDEA Open Model
CrossSectionFactory.FillCircle Method
 Circular shape - massive concrete shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public static void FillCircle(
	CrossSectionParameter css,
	double d
)
Public Shared Sub FillCircle (
	css As CrossSectionParameter,
	d As Double
)
public:
static void FillCircle(
	CrossSectionParameter^ css,
	double d
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
d
Type: System.Double
Diametrer of the shape
Return Value
Type:
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace